CAPIxHelp.org
#+TITLE: CAPIx 2.0 帮助
#+AUTHOR: aiwozhonghuaba
#+OPTIONS: ^:{}

* 简介
  致敬D大和他的CAPI(注入版)

  简介:

  CAPI是bathome的defanvie开发的一款第三方,堪称批处理第三方的登峰造极之作

  CAPI提供的最大功能就是一个:调用系统API 除此之外,CAPI并没有任何功能

  而且其注入式的特点,一方面使得其调用速度得到了飞一般的提升,另一方面也使得其能够保存进程数据

  这两个功能,赋予了CAPI无穷的力量

  何为系统API?简而言之,是MS为了便利开发者,而封装在dll中的一系列函数

  通过这些函数,开发者可以不需要理解系统的内部原理就方便地开发出产品

  比如著名的image(第一代),就是调用了gdi32中的API从而实现了绘图功能

  而利用CAPI,我们可以轻松地实现这个功能,而且由于CAPI是注入式的,我们可以甚至可以实现双缓冲

  即先把图片画到内存中的画布上,等待所有的图片都绘制完成,再将整块画布复制到CMD中

  这样做的最大好处就是可以避免闪烁,实现流畅地绘制


  然而CAPI有几个问题,导致了它虽然强大,但却很少被使用

  1.采取远程线程注入的方法将dll注入到cmd中,这是病毒的常用伎俩,因此误杀率极高

  2.开发者defanvie已经很久没有现身,而且CAPI没有开源.已经无法在最新的系统上运行了


  CAPIx就是为了解决这两个问题而开发的

  首先CAPIx摒弃了远程线程注入的方式,而是使用一个修改过的提取自win 2003的cmd

  这个cmd在启动时会自动加载CAPIx.dll,免去了注入的危险

  其次CAPIx的开发者是可以联系到的,而且CAPIx完全开源,这为修复bug和增加功能提供了方便

  并且CAPIx在API调用的功能上做出了进一步的加强

  在API Call之外又提供了一个新命令API Exec,用来调用遵循__cdecl约定的函数

  简而言之,可以调用其他dll中的函数,比如msvcrt中的大部分函数,像printf, scanf之类的

  又比如调用regex2.dll实现正则匹配,还可以自己写dll供Exec调用,比如写一个浮点运算的dll代替set/a之类的

  CAPIx潜力无限!

  下载地址: https://github.com/YinTianliang/CAPIx/tree/master/bin

  请务必下载CAPIx.dll和cmd.exe,  CAPIx_Help.html为详细帮助,建议下载

  使用CAPIx进行的程序只能在上面这个cmd.exe中正常运行

  所以建议使用以下JS启动游戏(该cmd.exe需要与js, capix.dll放在同一目录下)
  
  #+begin_src js -n
  new ActiveXObject('WScript.Shell').Run('"' + WScript.ScriptFullName.replace(/[^\\]*$/,'') + 'cmd.exe" /c 游戏主程序.bat')
  #+end_src

  或者在批处理开头加上这两行
  
  #+begin_src bat -n
  %1@start "" "%~dp0cmd.exe" "/c %~fs0 :"
  %1@exit
  #+end_src

  为了兼容以前的的CAPI作品, CAPIx的语法和CAPI是一样的, 只是在此基础之上做了加强, 使之更加人性化

  本文档中的大部分内容来自http://www.bathome.net/thread-19238-1-1.html

* 标识符
  标识符用来添加在参数前面, 指定这个参数的类型
  |      |      | <6>         |
  | 符号 | 大小 | 意义        |
  |------+------+-------------|
  | .    | 1B   | 字节        |
  | :    | 2B   | 短整形      |
  | ;    | 4B   | 长整形      |
  | ~    | 4B   | 浮点型      |
  | `    | 8B   | 双浮点型    |
  | #    | -    | 字符串(ANSI) |
  | $    | -    | 字符串(Unicode) |
  | *    | 4B   | 变量(的地址),相当于C语言中的&.可以后跟"; # $ "表示这个指针指向的变量的类型,默认为$ |
  | @    | -    | 移动指针,后跟欲移动的距离,可以为负 |

* 基本命令 

** Mem
*** Alloc
    Mem Alloc [size]
    + 用途:申请一块内存
    + 参数:[size]为该内存块的大小
    + 返回值:该内存块的地址
    + 注意:内存不用时需要释放, 避免造成内存泄漏
*** Free
    Mem Free [addr]
    + 用途:释放一块内存
    + 参数:[addr]为欲释放的内存地址
*** Put
    Mem Put [s][addr] [s][data] [s][data] ...
    + 用途:将数据按格式写入内存地址中
    + 参数:[s][addr]为欲写入的地址, [s]可选"; *". [s][data]为欲写入的数据, [s]可选". : ; ~ ` # $ * @"
    + 注意:写入的数据量若超过该内存块的大小可能导致cmd崩溃
