bin/CAPIxHelp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CAPIx 2.0 帮助</title>
<!-- 2017-02-11 Sat 19:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="aiwozhonghuaba" />


</head>
<body>
<div id="content">
<h1 class="title">CAPIx 2.0 帮助</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 简介</a></li>
<li><a href="#sec-2">2. 标识符</a></li>
<li><a href="#sec-3">3. 基本命令</a>
<ul>
<li><a href="#sec-3-1">3.1. Mem</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Alloc</a></li>
<li><a href="#sec-3-1-2">3.1.2. Free</a></li>
<li><a href="#sec-3-1-3">3.1.3. Put</a></li>
<li><a href="#sec-3-1-4">3.1.4. Print</a></li>
<li><a href="#sec-3-1-5">3.1.5. Copy</a></li>
<li><a href="#sec-3-1-6">3.1.6. 用途</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. API</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Call</a></li>
<li><a href="#sec-3-2-2">3.2.2. Exec</a></li>
<li><a href="#sec-3-2-3">3.2.3. 注</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. CAPIDll</a></li>
<li><a href="#sec-3-4">3.4. Var</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. SetCall</a></li>
<li><a href="#sec-3-4-2">3.4.2. GetCall</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. 实例</a>
<ul>
<li><a href="#sec-4-1">4.1. Mem Alloc Free</a></li>
<li><a href="#sec-4-2">4.2. Mem Put</a></li>
<li><a href="#sec-4-3">4.3. Mem Copy</a></li>
<li><a href="#sec-4-4">4.4. Mem Print</a></li>
<li><a href="#sec-4-5">4.5. API Call</a></li>
<li><a href="#sec-4-6">4.6. API Exec</a></li>
<li><a href="#sec-4-7">4.7. GetCall</a></li>
</ul>
</li>
<li><a href="#sec-5">5. CAPx相对CAPI有哪些改进</a></li>
<li><a href="#sec-6">6. 等待加入的功能</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
致敬D大和他的CAPI(注入版)
</p>

<p>
简介:
</p>

<p>
CAPI是bathome的defanvie开发的一款第三方,堪称批处理第三方的登峰造极之作
</p>

<p>
CAPI提供的最大功能就是一个:调用系统API 除此之外,CAPI并没有任何功能
</p>

<p>
而且其注入式的特点,一方面使得其调用速度得到了飞一般的提升,另一方面也使得其能够保存进程数据
</p>

<p>
这两个功能,赋予了CAPI无穷的力量
</p>

<p>
何为系统API?简而言之,是MS为了便利开发者,而封装在dll中的一系列函数
</p>

<p>
通过这些函数,开发者可以不需要理解系统的内部原理就方便地开发出产品
</p>

<p>
比如著名的image(第一代),就是调用了gdi32中的API从而实现了绘图功能
</p>

<p>
而利用CAPI,我们可以轻松地实现这个功能,而且由于CAPI是注入式的,我们可以甚至可以实现双缓冲
</p>

<p>
即先把图片画到内存中的画布上,等待所有的图片都绘制完成,再将整块画布复制到CMD中
</p>

<p>
这样做的最大好处就是可以避免闪烁,实现流畅地绘制
</p>


<p>
然而CAPI有几个问题,导致了它虽然强大,但却很少被使用
</p>

<p>
1.采取远程线程注入的方法将dll注入到cmd中,这是病毒的常用伎俩,因此误杀率极高
</p>

<p>
2.开发者defanvie已经很久没有现身,而且CAPI没有开源.已经无法在最新的系统上运行了
</p>


<p>
CAPIx就是为了解决这两个问题而开发的
</p>

<p>
首先CAPIx摒弃了远程线程注入的方式,而是使用一个修改过的提取自win 2003的cmd
</p>

<p>
这个cmd在启动时会自动加载CAPIx.dll,免去了注入的危险
</p>

<p>
其次CAPIx的开发者是可以联系到的,而且CAPIx完全开源,这为修复bug和增加功能提供了方便
</p>

<p>
并且CAPIx在API调用的功能上做出了进一步的加强
</p>

<p>
在API Call之外又提供了一个新命令API Exec,用来调用遵循__cdecl约定的函数
</p>

<p>
简而言之,可以调用其他dll中的函数,比如msvcrt中的大部分函数,像printf, scanf之类的
</p>

<p>
又比如调用regex2.dll实现正则匹配,还可以自己写dll供Exec调用,比如写一个浮点运算的dll代替set/a之类的
</p>

<p>
CAPIx潜力无限!
</p>

<p>
下载地址: <a href="https://github.com/YinTianliang/CAPIx/tree/master/bin">https://github.com/YinTianliang/CAPIx/tree/master/bin</a>
</p>

<p>
请务必下载CAPIx.dll和cmd.exe,  CAPIx_Help.html为详细帮助,建议下载
</p>

<p>
使用CAPIx进行的程序只能在上面这个cmd.exe中正常运行
</p>

<p>
所以建议使用以下JS启动游戏(该cmd.exe需要与js, capix.dll放在同一目录下)
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span><span style="color: #a020f0;">new</span> <span style="color: #228b22;">ActiveXObject</span>(<span style="color: #8b2252;">'WScript.Shell'</span>).Run(<span style="color: #8b2252;">'"'</span> + WScript.ScriptFullName.replace(<span style="color: #8b2252;">/[^\\]*$/</span>,<span style="color: #8b2252;">''</span>) + <span style="color: #8b2252;">'cmd.exe" /c &#28216;&#25103;&#20027;&#31243;&#24207;.bat'</span>)
</pre>
</div>

<p>
或者在批处理开头加上这两行
</p>

<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>%<span style="color: #a0522d;">1</span>@<span style="color: #a020f0;">start</span> <span style="color: #8b2252;">""</span> <span style="color: #8b2252;">"%~dp0cmd.exe"</span> <span style="color: #8b2252;">"/c %~fs0 :"</span>
<span class="linenr">2: </span>%<span style="color: #a0522d;">1</span>@<span style="color: #a020f0;">exit</span>
</pre>
</div>

<p>
为了兼容以前的的CAPI作品, CAPIx的语法和CAPI是一样的, 只是在此基础之上做了加强, 使之更加人性化
</p>

<p>
本文档中的大部分内容来自<a href="http://www.bathome.net/thread-19238-1-1.html">http://www.bathome.net/thread-19238-1-1.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 标识符</h2>
<div class="outline-text-2" id="text-2">
<p>
标识符用来添加在参数前面, 指定这个参数的类型
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">符号</th>
<th scope="col" class="left">大小</th>
<th scope="col" class="left">意义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">.</td>
<td class="left">1B</td>
<td class="left">字节</td>
</tr>

<tr>
<td class="left">:</td>
<td class="left">2B</td>
<td class="left">短整形</td>
</tr>

<tr>
<td class="left">;</td>
<td class="left">4B</td>
<td class="left">长整形</td>
</tr>

<tr>
<td class="left">~</td>
<td class="left">4B</td>
<td class="left">浮点型</td>
</tr>

<tr>
<td class="left">`</td>
<td class="left">8B</td>
<td class="left">双浮点型</td>
</tr>

<tr>
<td class="left">#</td>
<td class="left">-</td>
<td class="left">字符串(ANSI)</td>
</tr>

<tr>
<td class="left">$</td>
<td class="left">-</td>
<td class="left">字符串(Unicode)</td>
</tr>

<tr>
<td class="left">*</td>
<td class="left">4B</td>
<td class="left">变量(的地址),相当于C语言中的&amp;.可以后跟"; # $ "表示这个指针指向的变量的类型,默认为$</td>
</tr>

<tr>
<td class="left">@</td>
<td class="left">-</td>
<td class="left">移动指针,后跟欲移动的距离,可以为负</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 基本命令</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Mem</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Alloc</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Mem Alloc [size]
</p>
<ul class="org-ul">
<li>用途:申请一块内存
</li>
<li>参数:[size]为该内存块的大小
</li>
<li>返回值:该内存块的地址
</li>
<li>注意:内存不用时需要释放, 避免造成内存泄漏
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Free</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Mem Free [addr]
</p>
<ul class="org-ul">
<li>用途:释放一块内存
</li>
<li>参数:[addr]为欲释放的内存地址
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Put</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Mem Put [s][addr] [s][data] [s][data] &#x2026;
</p>
<ul class="org-ul">
<li>用途:将数据按格式写入内存地址中
</li>
<li>参数:[s][addr]为欲写入的地址, [s]可选"; *". [s][data]为欲写入的数据, [s]可选". : ; ~ ` # $ * @"
</li>
<li>注意:写入的数据量若超过该内存块的大小可能导致cmd崩溃
</li>
</ul>
</div>
</div>
