bin/CAPIxHelp.html
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> Print</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Mem Print [s][addr] [s][var] [s][var] &#x2026;
</p>
<ul class="org-ul">
<li>用途:将指定地址处的内容输出到变量中
</li>
<li>参数:[s][addr]为内存地址, [s]可选"; *". [s][var]为输出参数, [s]可选". : ; ~ ` # $ * @", [var]为变量名
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> Copy</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
Mem Copy [s][dst] [s][src] [sz]
</p>
<ul class="org-ul">
<li>用途:将源地址的一段内存复制到目标地址
</li>
<li>参数:[s]可选"; *"
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4">3.1.6</span> 用途</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
Mem系列的命令提供了对内存的操作,其最大的意义就在于实现结构体或数组
</p>

<p>
使用时要注意结构体的对齐
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> API</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Call</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
API Call [dll] [s][API] [s][data] [s][data] &#x2026;
</p>
<ul class="org-ul">
<li>用途:调用遵循__stdcall约定的函数(一般为WINAPI)
</li>
<li>参数:[dll]为dll相对路径, [API]为API函数全名, [s]为返回值类型, 默认为";", 可选"~ `". [s][data]为参数, [s]可选"; ~ ` $ # *"
</li>
<li>返回值:该API的返回值
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Exec</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
API Exec [dll] [s][API] [s][data] [s][data] &#x2026;
</p>
<ul class="org-ul">
<li>用途:调用遵循__cdecl约定的函数(一般除WINAPI以外都是)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> 注</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
API是可以指定返回值类型的
</p>

<p>
以上两个命令的[s][API]可以用该函数在内存中对应的地址来表示,此时[dll]应为"0"
</p>

<p>
如set CAPI=API Exec 0 16777215 ;0 ;1
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> CAPIDll</h3>
<div class="outline-text-3" id="text-3-3">
<dl class="org-dl">
<dt> CAPIll /? </dt><dd>返回CAPIx的基本信息
</dd>
<dt> CAPIDll Ver </dt><dd>返回CAPIx的版本, 保存在变量CAPI_Ret中
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Var</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> SetCall</h4>
<div class="outline-text-4" id="text-3-4-1">
<dl class="org-dl">
<dt> SetCall Enable </dt><dd>开启SetCall调用方式,即set CAPI=xxxx,返回值在变量CAPI_Re中t
</dd>
<dt> SetCall Disable </dt><dd>关闭SetCall调用方式(默认开启)
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> GetCall</h4>
<div class="outline-text-4" id="text-3-4-2">
<dl class="org-dl">
<dt> GetCall Enable </dt><dd>开启GetCall调用方式,即echo %CAPI xxx%,返回值即%CAPI xxx%扩展的结果
</dd>
<dt> GetCall Disable </dt><dd>关闭GetCall调用方式 
</dd>
</dl>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 实例</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Mem Alloc Free</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> off
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"CAPI=Mem Alloc 4"</span>
<span class="linenr">3: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"lpAddress=%CAPI_Ret%"</span>
<span class="linenr">4: </span><span style="color: #483d8b;">echo</span> %<span style="color: #a0522d;">lpAddress</span>%
<span class="linenr">5: </span><span style="color: #483d8b;">pause</span>
<span class="linenr">6: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"CAPI=Mem Free %lpAddress%"</span>
<span class="linenr">7: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
<p>
创建了一块大小为4的内存，内存地址保存在lpAddress里<br  />
   在批处理第一次暂停时，使用工具查看cmd.exe内存，可以看到在输出的地址处为4个空白字节的内存，第二次pause时，可以看到内存已经被释放
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Mem Put</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> off
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">var</span>=hello
<span class="linenr">3: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">data</span>=0123456789
<span class="linenr">4: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"CAPI=Mem Put *data .97 @1 :25105 #ab $ab *var"</span>
<span class="linenr">5: </span><span style="color: #483d8b;">echo</span> %<span style="color: #a0522d;">data</span>%
<span class="linenr">6: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
<p>
执行前data变量的内存内容为30 00 31 00 32 00 33 00 34 00 35 00 36 00 37 00 38 00 39 00<br  />
   执行写入命令时，此时指针指向第1个字节，.97将1个字节为97写入，于是变成了61 00 31 00 &#x2026;，指针后移1位，指向第2个字节<br  />
   @1将指针后移1位，此时指针指向第3个字节<br  />
</p>
<p>
:25105，此时指针指向第3个字节，将2个字节为25105写入，于是变成了61 00 62 11 32 00 &#x2026;，指针后移2位<br  />
   #ab，此时指针指向第5位，将2个字节的ANSI字符串ab写入，于是变成了61 00 62 11 61 62 33 00 34 00 &#x2026;，指针后移2位<br  />
   $ab，此时指针指向第7位，将4个字节的Unicode字符串ab写入，于是变成了61 00 62 11 61 62 61 00 62 00 &#x2026;，指针后移4位<br  />
   /h*var，此时指针指向第11位，将var变量h的内容全部写入<br  />
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Mem Copy</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> off
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">var</span>=hello
<span class="linenr">3: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">data</span>=0123456789
<span class="linenr">4: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"CAPI=Mem Copy *data *var 6"</span>
<span class="linenr">5: </span><span style="color: #483d8b;">echo</span> %<span style="color: #a0522d;">data</span>%
<span class="linenr">6: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
<p>
执行时，将var变量的前4个字节复制到data变量中，即是“hel”<br  />
因此输出“hel3456789”
</p>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Mem Print</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> off
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">var</span>=0123456
<span class="linenr">3: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"CAPI=Mem Print *var .output_1 @2 :output_2 @1 #output_3 $output_4"</span>
<span class="linenr">4: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">output</span>_
<span class="linenr">5: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
<p>
var变量的内容为30 00 31 00 32 00 33 00 34 00 35 00 36 00<br  />
.output_1，此时指向第1个字节，将1字节的内容“31”放入output_1变量中，也就是48 <br  />
@2，此时指针指向第2个字节，将指针后移2位，此时指针指向第4个字节<br  />
:output_2，此时指针指向第4个字节，将2字节的内容“00 32”放入output_2变量中，也就是12800 <br  />
@1，此时指针指向第6个字节，将指针后移1位，此时指针指向第7个字节<br  />
#output_3，此时指针指向第7个字节，将接下来的内容作为ANSI字符串放入output_3变量中，也就是“33”，字符串3 <br  />
$output_4，此时指针指向第9个字节，将接下来的内容作为Unicode字符串放入output_4变量中，也就是“34 00 35 00 36 00”，字符串456 <br  />
</p>
</div>
</div>
