CAPIxHelp.md

### Print<a id="sec-3-1-4" name="sec-3-1-4"></a>

Mem Print [s][addr] [s][var] [s][var] &#x2026;
-   用途:将指定地址处的内容输出到变量中
-   参数:[s][addr]为内存地址, [s]可选"; \*". [s][var]为输出参数, [s]可选". : ; ~ \` # $ \* @", [var]为变量名

### Copy<a id="sec-3-1-5" name="sec-3-1-5"></a>

Mem Copy [s][dst] [s][src] [sz]
-   用途:将源地址的一段内存复制到目标地址
-   参数:[s]可选"; \*"

### 用途<a id="sec-3-1-6" name="sec-3-1-6"></a>

Mem系列的命令提供了对内存的操作,其最大的意义就在于实现结构体或数组

使用时要注意结构体的对齐

## API<a id="sec-3-2" name="sec-3-2"></a>

### Call<a id="sec-3-2-1" name="sec-3-2-1"></a>

API Call [dll] [s][API] [s][data] [s][data] &#x2026;
-   用途:调用遵循\_\_stdcall约定的函数(一般为WINAPI)
-   参数:[dll]为dll相对路径, [API]为API函数全名, [s]为返回值类型, 默认为";", 可选"~ \`". [s][data]为参数, [s]可选"; ~ \` $ # \*"
-   返回值:该API的返回值

### Exec<a id="sec-3-2-2" name="sec-3-2-2"></a>

API Exec [dll] [s][API] [s][data] [s][data] &#x2026;
-   用途:调用遵循\_\_cdecl约定的函数(一般除WINAPI以外都是)

### 注<a id="sec-3-2-3" name="sec-3-2-3"></a>

API是可以指定返回值类型的

以上两个命令的[s][API]可以用该函数在内存中对应的地址来表示,此时[dll]应为"0"

如set CAPI=API Exec 0 16777215 ;0 ;1

## CAPIDll<a id="sec-3-3" name="sec-3-3"></a>

-   **CAPIll /?:** 返回CAPIx的基本信息
-   **CAPIDll Ver:** 返回CAPIx的版本, 保存在变量CAPI\_Ret中

## Var<a id="sec-3-4" name="sec-3-4"></a>

### SetCall<a id="sec-3-4-1" name="sec-3-4-1"></a>

-   **SetCall Enable:** 开启SetCall调用方式,即set CAPI=xxxx,返回值在变量CAPI\_Re中t
-   **SetCall Disable:** 关闭SetCall调用方式(默认开启)

### GetCall<a id="sec-3-4-2" name="sec-3-4-2"></a>

-   **GetCall Enable:** 开启GetCall调用方式,即echo %CAPI xxx%,返回值即%CAPI xxx%扩展的结果
-   **GetCall Disable:** 关闭GetCall调用方式

# 实例<a id="sec-4" name="sec-4"></a>

## Mem Alloc Free<a id="sec-4-1" name="sec-4-1"></a>

    1  @echo off
    2  set "CAPI=Mem Alloc 4"
    3  set "lpAddress=%CAPI_Ret%"
    4  echo %lpAddress%
    5  pause
    6  set "CAPI=Mem Free %lpAddress%"
    7  pause

创建了一块大小为4的内存，内存地址保存在lpAddress里  
   在批处理第一次暂停时，使用工具查看cmd.exe内存，可以看到在输出的地址处为4个空白字节的内存，第二次pause时，可以看到内存已经被释放

## Mem Put<a id="sec-4-2" name="sec-4-2"></a>

    1  @echo off
    2  set var=hello
    3  set data=0123456789
    4  set "CAPI=Mem Put *data .97 @1 :25105 #ab $ab *var"
    5  echo %data%
    6  pause

执行前data变量的内存内容为30 00 31 00 32 00 33 00 34 00 35 00 36 00 37 00 38 00 39 00  
   执行写入命令时，此时指针指向第1个字节，.97将1个字节为97写入，于是变成了61 00 31 00 &#x2026;，指针后移1位，指向第2个字节  
   @1将指针后移1位，此时指针指向第3个字节  

:25105，此时指针指向第3个字节，将2个字节为25105写入，于是变成了61 00 62 11 32 00 &#x2026;，指针后移2位  
   #ab，此时指针指向第5位，将2个字节的ANSI字符串ab写入，于是变成了61 00 62 11 61 62 33 00 34 00 &#x2026;，指针后移2位  
   $ab，此时指针指向第7位，将4个字节的Unicode字符串ab写入，于是变成了61 00 62 11 61 62 61 00 62 00 &#x2026;，指针后移4位  
   /h\*var，此时指针指向第11位，将var变量h的内容全部写入  

## Mem Copy<a id="sec-4-3" name="sec-4-3"></a>

    1  @echo off
    2  set var=hello
    3  set data=0123456789
    4  set "CAPI=Mem Copy *data *var 6"
    5  echo %data%
    6  pause

执行时，将var变量的前4个字节复制到data变量中，即是“hel”  
因此输出“hel3456789”

## Mem Print<a id="sec-4-4" name="sec-4-4"></a>

    1  @echo off
    2  set var=0123456
    3  set "CAPI=Mem Print *var .output_1 @2 :output_2 @1 #output_3 $output_4"
    4  set output_
    5  pause

var变量的内容为30 00 31 00 32 00 33 00 34 00 35 00 36 00  
.output\_1，此时指向第1个字节，将1字节的内容“31”放入output\_1变量中，也就是48   
@2，此时指针指向第2个字节，将指针后移2位，此时指针指向第4个字节  
:output\_2，此时指针指向第4个字节，将2字节的内容“00 32”放入output\_2变量中，也就是12800   
@1，此时指针指向第6个字节，将指针后移1位，此时指针指向第7个字节  
#output\_3，此时指针指向第7个字节，将接下来的内容作为ANSI字符串放入output\_3变量中，也就是“33”，字符串3   
$output\_4，此时指针指向第9个字节，将接下来的内容作为Unicode字符串放入output\_4变量中，也就是“34 00 35 00 36 00”，字符串456   
