CAPIxHelp.org
** API Call
#+BEGIN_SRC bat -n
@echo off
set "data=message"
set "CAPI=API Call user32 MessageBoxW ;0 *data $title ;1"
echo %CAPI_Ret%
pause
#+END_SRC
调用API MessageBox，第一个参数为0，第二个参数为data变量的地址，第三个参数为Unicode字符串title，第四个参数为1\\
由于CMD内部将变量data储存为Unicode，因此应使用Unicode版本的API，也就是MessageBoxW\\
(注:CAPIx的*标识符得到了增强,可以使用*#data来强制将data转换为ANSI字符串)\\

** API Exec
#+BEGIN_SRC bat -n 
@echo off
set "data=123|456|789"
set CAPI=API Exec msvcrt sscanf *#data "#%d|%^d|%d" *;_1 *;_2
echo %_1%  %_2%
pause
#+END_SRC
调用C语言库函数sscanf,该函数遵循cdecl调用协定,因此只能使用Exec调用\\
第一个参数*#data表示取变量data的内容, 转换为ANSI字符串, 第二个参数为sscanf的Format, 第三个和第四个参数取了两个整形变量地址\\


#+begin_src bat -n
@echo off
set "CAPI=API Exec msvcrt `sqrt `666"
echo %CAPI_Ret%
pause
#+end_src
调用C语言库函数sqrt,且指定返回值类型为双浮点数

#+begin_src bat -n
@echo off
set "CAPI=API Exec msvcrt scanf "#%d %d" *;_1 *;_2"
echo %_1%, %_2%
pause
#+end_src
调用C语言库函数scanf, *;_1 的意思是取环境变量_1的地址,将其当作整形变量传给scanf

** GetCall
#+begin_src bat -n
@echo offh
set CAPI=Var GetCall Enable
set lpAddress=%CAPI Mem Alloc 4%
echo 申请的内存地址为:%lpAddress%
set CAPI=Mem Free %lpAddress%
pause
#+end_src

* CAPIx相对CAPI有哪些改进
  + "@"可以接受负值
  + 参数类型中增加了浮点数和双浮点数
  + 为函数返回值提供了类型
  + "*"可以通过后跟"; # $"来指定该变量类型
  + "*"不只是取变量内容, 而是取变量地址.API对该地址的修改会同步到变量中
  + "Exec"命令的加入
  + 可以运行内存中的函数
* 等待加入的功能
  + COM调用
