bin/CAPIxHelp.html

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> API Call</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> off
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"data=message"</span>
<span class="linenr">3: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"CAPI=API Call </span><span style="color: #008b8b;">user32</span><span style="color: #8b2252;"> MessageBoxW ;0 *data $title ;1"</span>
<span class="linenr">4: </span><span style="color: #483d8b;">echo</span> %<span style="color: #a0522d;">CAPI</span>_Ret%
<span class="linenr">5: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
<p>
调用API MessageBox，第一个参数为0，第二个参数为data变量的地址，第三个参数为Unicode字符串title，第四个参数为1<br  />
由于CMD内部将变量data储存为Unicode，因此应使用Unicode版本的API，也就是MessageBoxW<br  />
(注:CAPIx的*标识符得到了增强,可以使用*#data来强制将data转换为ANSI字符串)<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> API Exec</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> off
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"data=123|456|789"</span>
<span class="linenr">3: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">CAPI</span>=API Exec msvcrt sscanf *#data <span style="color: #8b2252;">"#%d|%^d|%d"</span> *;_1 *;_2
<span class="linenr">4: </span><span style="color: #483d8b;">echo</span> %_1%  %_2%
<span class="linenr">5: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
<p>
调用C语言库函数sscanf,该函数遵循cdecl调用协定,因此只能使用Exec调用<br  />
第一个参数*#data表示取变量data的内容, 转换为ANSI字符串, 第二个参数为sscanf的Format, 第三个和第四个参数取了两个整形变量地址<br  />
</p>


<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> off
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"CAPI=API Exec msvcrt `sqrt `666"</span>
<span class="linenr">3: </span><span style="color: #483d8b;">echo</span> %<span style="color: #a0522d;">CAPI</span>_Ret%
<span class="linenr">4: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
<p>
调用C语言库函数sqrt,且指定返回值类型为双浮点数
</p>

<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> off
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #8b2252;">"CAPI=API Exec msvcrt scanf "</span>#%<span style="color: #a0522d;">d</span> %<span style="color: #a0522d;">d</span><span style="color: #8b2252;">" *;_1 *;_2"</span>
<span class="linenr">3: </span><span style="color: #483d8b;">echo</span> %_1%, %_2%
<span class="linenr">4: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
<p>
调用C语言库函数scanf, *;_1 的意思是取环境变量_1的地址,将其当作整形变量传给scanf
</p>
</div>
</div>

<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> GetCall</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">

<pre class="src src-bat"><span class="linenr">1: </span>@<span style="color: #483d8b;">echo</span> offh
<span class="linenr">2: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">CAPI</span>=Var GetCall Enable
<span class="linenr">3: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">lpAddress</span>=%<span style="color: #a0522d;">CAPI</span> Mem Alloc 4%
<span class="linenr">4: </span><span style="color: #483d8b;">echo</span> &#30003;&#35831;&#30340;&#20869;&#23384;&#22320;&#22336;&#20026;:%<span style="color: #a0522d;">lpAddress</span>%
<span class="linenr">5: </span><span style="color: #483d8b;">set</span> <span style="color: #a0522d;">CAPI</span>=Mem Free %<span style="color: #a0522d;">lpAddress</span>%
<span class="linenr">6: </span><span style="color: #483d8b;">pause</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> CAPx相对CAPI有哪些改进</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>"@"可以接受负值
</li>
<li>参数类型中增加了浮点数和双浮点数
</li>
<li>为函数返回值提供了类型
</li>
<li>"*"可以通过后跟"; # $"来指定该变量类型
</li>
<li>"*"不只是取变量内容, 而是取变量地址.API对该地址的修改会同步到变量中
</li>
<li>"Exec"命令的加入
</li>
<li>可以运行内存中的函数
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 等待加入的功能</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>COM调用
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: aiwozhonghuaba</p>
<p class="date">Created: 2017-02-11 Sat 19:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>