CAPIxHelp.md

## API Call<a id="sec-4-5" name="sec-4-5"></a>

    1  @echo off
    2  set "data=message"
    3  set "CAPI=API Call user32 MessageBoxW ;0 *data $title ;1"
    4  echo %CAPI_Ret%
    5  pause

调用API MessageBox，第一个参数为0，第二个参数为data变量的地址，第三个参数为Unicode字符串title，第四个参数为1  
由于CMD内部将变量data储存为Unicode，因此应使用Unicode版本的API，也就是MessageBoxW  
(注:CAPIx的\*标识符得到了增强,可以使用\*#data来强制将data转换为ANSI字符串)  

## API Exec<a id="sec-4-6" name="sec-4-6"></a>

    1  @echo off
    2  set "data=123|456|789"
    3  set CAPI=API Exec msvcrt sscanf *#data "#%d|%^d|%d" *;_1 *;_2
    4  echo %_1%  %_2%
    5  pause

调用C语言库函数sscanf,该函数遵循cdecl调用协定,因此只能使用Exec调用  
第一个参数\*#data表示取变量data的内容, 转换为ANSI字符串, 第二个参数为sscanf的Format, 第三个和第四个参数取了两个整形变量地址  

    1  @echo off
    2  set "CAPI=API Exec msvcrt `sqrt `666"
    3  echo %CAPI_Ret%
    4  pause

调用C语言库函数sqrt,且指定返回值类型为双浮点数

    1  @echo off
    2  set "CAPI=API Exec msvcrt scanf "#%d %d" *;_1 *;_2"
    3  echo %_1%, %_2%
    4  pause

调用C语言库函数scanf, \*;\_1 的意思是取环境变量\_1的地址,将其当作整形变量传给scanf

## GetCall<a id="sec-4-7" name="sec-4-7"></a>

    1  @echo offh
    2  set CAPI=Var GetCall Enable
    3  set lpAddress=%CAPI Mem Alloc 4%
    4  echo 申请的内存地址为:%lpAddress%
    5  set CAPI=Mem Free %lpAddress%
    6  pause

# CAPIx相对CAPI有哪些改进<a id="sec-5" name="sec-5"></a>

-   "@"可以接受负值
-   参数类型中增加了浮点数和双浮点数
-   为函数返回值提供了类型
-   "\*"可以通过后跟"; # $"来指定该变量类型
-   "\*"不只是取变量内容, 而是取变量地址.API对该地址的修改会同步到变量中
-   "Exec"命令的加入
-   可以运行内存中的函数

# 等待加入的功能<a id="sec-6" name="sec-6"></a>

-   COM调用